Revit 2027 API
InternalDefinition.GetGroupTypeId Method
 Gets the identifier of the built-in parameter group to which the parameter defined by this definition belongs.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public override ForgeTypeId GetGroupTypeId()
Public Overrides Function GetGroupTypeId As ForgeTypeId
public:
virtual ForgeTypeId^ GetGroupTypeId() override
abstract GetGroupTypeId : unit -> ForgeTypeId
override GetGroupTypeId : unit -> ForgeTypeId
Return Value
ForgeTypeId
See Also
Reference
InternalDefinition Class
Autodesk.Revit.DB Namespace